MicrochipTech/PIC32MZW1_Matter_Project/src/platform/wfi32/ConnectivityManagerImpl.cpp
#if 0
        for (uint8_t i = 0; i < LWIP_IPV6_NUM_ADDRESSES; i++)
        {
            if (ip6_addr_islinklocal(netif_ip6_addr(netif, i)) &&
                ip6_addr_isvalid(netif_ip6_addr_state(netif, i)))
            {

                //ChipLogProgress(DeviceLayer,"IPv6 Address %i Assigned : %s", i, ip6addr_ntoa(netif_ip6_addr(netif, i)));
                ConnectivityManagerImpl().OnIPAddressAvailable();
                return;
            }
        }
#endif
       
    }
    
    return;
}

void ConnectivityManagerImpl::NetworkProvisioningCallback(char* ssid, char* password, uint8_t auth)
{
    CHIP_ERROR err                = CHIP_NO_ERROR;
    char wifimode[] = "station";

    ChipLogProgress(DeviceLayer, "NetworkProvisioningCallback() In...ssid: %s ssidlen %d, password:%s, passworlen %d", ssid, strlen(ssid), password, strlen(password));

    err = Internal::PIC32MZW1Config::WriteConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiSSID, ssid, strlen(ssid));
    SuccessOrExit(err);

    vTaskDelay( 100 );
    err = Internal::PIC32MZW1Config::WriteConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiPassword, password, strlen(password));
    SuccessOrExit(err);
    vTaskDelay( 100 );
    
    err = Internal::PIC32MZW1Config::WriteConfigValue(Internal::PIC32MZW1Config::kConfigKey_WiFiSecurity, (uint32_t) auth);
    SuccessOrExit(err);
    vTaskDelay( 100 );
    
    err = Internal::PIC32MZW1Config::WriteConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiMode, wifimode, strlen(wifimode));
    SuccessOrExit(err);
    vTaskDelay( 100 );

    ChipLogProgress(DeviceLayer, "System reset..");  
    Internal::PIC32MZW1Config::SystemReset();
    
exit:
    ChipLogProgress(DeviceLayer, "Fail to provision network, WriteConfigValue error..");    
    return;
}

// ==================== ConnectivityManager Platform Internal Methods ====================
CHIP_ERROR ConnectivityManagerImpl::_Init()
{
    CHIP_ERROR err                = CHIP_NO_ERROR;
    mLastStationConnectFailTime   = System::Clock::kZero;
    mLastAPDemandTime             = System::Clock::kZero;
    mWiFiStationMode              = kWiFiStationMode_Disabled;
    mWiFiStationState             = kWiFiStationState_NotConnected;
    mWiFiAPMode                   = kWiFiAPMode_Disabled;
    mWiFiAPState                  = kWiFiAPState_NotActive;
    mWiFiStationReconnectInterval = System::Clock::Milliseconds32(CHIP_DEVICE_CONFIG_WIFI_STATION_RECONNECT_INTERVAL);
    mWiFiAPIdleTimeout            = System::Clock::Milliseconds32(CHIP_DEVICE_CONFIG_WIFI_AP_IDLE_TIMEOUT);
    mFlags.SetRaw(0);
    ap_channel                    = 0;

    // WiFi-Station mode is enabled by default
    
    ChipLogProgress(DeviceLayer, "ConnectivityManagerImpl() Init..");

    char ssid[DeviceLayer::Internal::kMaxWiFiSSIDLength];
    char password[DeviceLayer::Internal::kMaxWiFiKeyLength];
    uint32_t auth    = 0;
    char wifi_mode[10];
    size_t offset = 0;
    int softAP = 0;
    
    
    err = Internal::PIC32MZW1Config::ReadConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiMode, wifi_mode, sizeof(wifi_mode), offset);
    if (err != CHIP_NO_ERROR)
    {
        ChipLogProgress(DeviceLayer, "No WiFiMode argument in the Key Store, default is station mode");
    }
    else
    {
        if (strcmp(wifi_mode, "softAP") == 0)
            softAP = 1;
    }
    
    Network_PIC32MZW_Set_WiFi_Mode(softAP);

    err = Internal::PIC32MZW1Utils::pic32mzw1_wifi_init();
    if (err != CHIP_NO_ERROR)
    {
        return err;
    }

    PlatformMgr().AddEventHandler(
        [](const ChipDeviceEvent * event, intptr_t arg) {
            // Restart the server whenever an ip address is renewed
            if (event->Type == DeviceEventType::kWiFiConnectivityChange)
            {
                if (event->WiFiConnectivityChange.Result == ConnectivityChange::kConnectivity_Established)
                {
                    ChipLogProgress(DeviceLayer,"ConnectivityManager receive  kConnectivity_Established..\r\n");
                    
                    Network_PIC32MZW_StartDHCP(&ConnectivityManagerImpl::DHCPStatusCallback);
                }
                else if (event->WiFiConnectivityChange.Result == ConnectivityChange::kConnectivity_Lost)
                {
                    ChipLogProgress(DeviceLayer,"ConnectivityManager receive  kConnectivity_Lost..\r\n");
                    
                    Network_PIC32MZW_StopDHCP();
                }
  
            }
        },
        0);

    if (softAP)
    {
        //For AP mode test
        ReturnErrorOnFailure(SetWiFiAPMode(kWiFiAPMode_Enabled));
    }
    else
    {

        // If there is no persistent station provision...
        if (!IsWiFiStationProvisioned())
        {
            ChipLogProgress(DeviceLayer, "ConnectivityManagerImpl() log2");

            if (CHIP_NO_ERROR == Internal::PIC32MZW1Config::ReadConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiSSID, ssid, sizeof(ssid), offset))
            {
                if (CHIP_NO_ERROR == Internal::PIC32MZW1Config::ReadConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiPassword, password, sizeof(password), offset))
                    if (CHIP_NO_ERROR == Internal::PIC32MZW1Config::ReadConfigValue(Internal::PIC32MZW1Config::kConfigKey_WiFiSecurity, auth))
                    {
                        mIsProvisioned = true;
                        ReturnErrorOnFailure(SetWiFiStationMode(kWiFiStationMode_Enabled));
                    }
            }
            else if (!mIsProvisioned && CHIP_DEVICE_CONFIG_DEFAULT_STA_SSID[0] != 0)
            {
                ChipLogProgress(DeviceLayer, "ConnectivityManagerImpl() log3");
                err = Internal::PIC32MZW1Config::WriteConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiSSID, CHIP_DEVICE_CONFIG_DEFAULT_STA_SSID, strlen(CHIP_DEVICE_CONFIG_DEFAULT_STA_SSID));
                SuccessOrExit(err);
                err = Internal::PIC32MZW1Config::WriteConfigValueStr(Internal::PIC32MZW1Config::kConfigKey_WiFiPassword, CHIP_DEVICE_CONFIG_DEFAULT_STA_PASSWORD, strlen(CHIP_DEVICE_CONFIG_DEFAULT_STA_PASSWORD));
                SuccessOrExit(err);
                err = Internal::PIC32MZW1Config::WriteConfigValue(Internal::PIC32MZW1Config::kConfigKey_WiFiSecurity, (uint32_t) CHIP_DEVICE_CONFIG_DEFAULT_STA_SECURITY);
                SuccessOrExit(err);

